--[JOIN]
--; 관계형 데이터베이스 시스템
-- (Oracle, MySQL(Maria), SQL-Server(MS-SQL)...)
-- 테이블-테이블 연관 관계를 맺고 있다
-- ex) emp-dno : 사원이 어느 부서에 소속되어 있는지
--     dept-dno : 사원번호
--     김연아 02 - 02 회계부서
     
--1) 각 사원의 근무 부서를 검색한다



--등가 조인
--; 두 테이블의 공통 컬럼을 = 연산자로 조건을 부여한 것


--2) 광주에서 근무하는 직원의 명단을 검색하세요
--  (부서번호와 부서명도 검색하세요)



--비등가 조인(특정값의 범위를 얻을 때)
--; 한 테이블의 특정값을 가지고,
-- 다른 테이블에서 범위 결과를 추출할 때
--3) 각 직원의 급여를 10%인상한 경우 급여 등급을 검색한다



--4) 잘못된 조인 (Cross Join)
--; 조인 조건이 없으면 Cross Join 이라고 하며
-- 테이블들의 모든 행이 1:1 교차하게 된다.
-- 결과에 의미가 없다

  
  
  
  
  
  
  
  
  
  
  
  



